[
    {
        "name": "Storytime Foundation",
        "description": "",
        "caption": "A redesign for the charity, Storytime, an organization that focuses on helping strengthen whānau facing adversity in Aotearoa by supporting the building of bonds between a parent and child.",
        "url": "https://storytime-frontend-woad.vercel.app/#/",
        "urlCase": "https://www.behance.net/gallery/216947379/The-Storytime-Foundation/modules/1235623923",
        "previewMockup": "./images/storytime-foundation-preview-mockups.png",
        "previewImage": "./images/storytime-mockup-prev.png",
        "biographyBrief": "The redesign and recoding of the Storytime website focused on creating an inclusive and accessible digital space that aligns with the organization’s mission to support New Zealand families. The project aimed to enhance the user experience by improving accessibility, cultural representation, and mindful content presentation. Key design principles incorporated bicultural elements through te reo Māori integration and embraced diversity to ensure that every visitor feels seen and valued. Additionally, the redesign emphasized interactive and engaging resources, fostering connections between parents and children while supporting the foundation’s community initiatives.",
        "biographyTools": "This project utilized a range of modern tools and technologies to achieve its goals. The frontend was developed with Vite and React, ensuring a fast and responsive user interface. On the backend, a custom WordPress CMS theme was created, enhanced by WooCommerce for e-commerce functionality and various WordPress plugins for added features. A full-stack architecture integrated a robust database to manage dynamic content, store data, and handle user interactions securely. These tools allowed for seamless integration of the donation portal, store, and educational resources, creating a comprehensive and user-friendly platform.",
        "biographyOutcome": "The final website successfully transformed Storytime into an inviting and culturally enriched platform. It features a vibrant design with an imaginative and colorful aesthetic that reflects the foundation’s values. The site includes a streamlined donation process, an accessible online store, and thoughtfully curated resources for families. Accessibility standards, such as WCAG compliance, were incorporated to make the website usable for individuals of all abilities. By integrating user feedback, the design maintained consistent typography, responsive layouts, and interactive storytelling elements, ensuring the platform resonates with its primary and secondary audiences.",
        "biographyReflection": "This project demonstrated the importance of user-centered design and cultural awareness in web development. The redesign process provided valuable insights into balancing aesthetic appeal with functionality and inclusivity. Survey results and user feedback guided decisions that prioritized accessibility, cultural representation, and content relevance. While the project achieved its goals, it also highlighted areas for future improvement, such as refining design consistency and adding more interactive features. Overall, the experience underscored the value of collaboration, iterative design, and mindful development in creating a meaningful and impactful digital experience.",
        "tags": ["React", "User testing", "Wordpress", "Client Contract", "Fullstack"],
        "mockup1": "./images/storytimemockup1.jpg",
        "mockup2": "./images/storytimemockup2.jpg",
        "mockup3": "./images/storytimemockup3.jpg",
        "mockup4": "./images/storytimemockup4.jpg",
        "screenshot1": "./images/storytime-screenshot-1.png",
        "screenshot2": "./images/storytime-screenshot-2.png",
        "logo": "./images/storytime-logo.png",
        "date": "2024-12-01"
    },
    {
        "name": "Hospice NZ",
        "description": "",
        "caption": "A compassionate and user-friendly website that improves accessibility and enhances the emotional connection for visitors seeking hospice care information, to provide a supportive, welcoming online experience.",
        "url": "https://hospice-frontend.vercel.app/",
        "previewMockup": "./images/hospice-preview-mockup.png",
        "previewImage": "./images/hospice-mockup-prev.png",
        "biographyBrief": "The redesign and recoding of the Hospice NZ website focused on creating a compassionate and accessible platform that reflects the organization’s commitment to providing support for individuals and families facing end-of-life care. The project aimed to enhance user experience through intuitive navigation, emotional resonance, and easy access to vital resources, while prioritizing a soothing, respectful, and inclusive design.",
        "biographyTools": "The project was built using modern tools and technologies, with the frontend developed in React for a dynamic and responsive interface. A custom WordPress theme was implemented on the backend, allowing for efficient content management, while WooCommerce was integrated for donation functionality, ensuring a seamless, user-friendly experience for visitors seeking care information and support.",
        "biographyOutcome": "The final website successfully transformed Hospice NZ's online presence, offering a calming and user-centric design that makes critical resources easy to access. The platform provides clear navigation to information about services, donations, and support, while adhering to WCAG accessibility standards to ensure inclusivity for all visitors, regardless of ability.",
        "biographyReflection": "This project underscored the importance of empathetic design in web development, especially for sensitive topics like end-of-life care. By prioritizing accessibility, emotional appeal, and ease of use, the redesign helped make Hospice NZ’s digital space more supportive for families. The experience reinforced the value of user-centered design, collaborative development, and the power of digital tools to foster connection and understanding in crucial moments.",
        "tags": ["React", "User testing", "Wordpress", "Client Contract", "Fullstack"],
        "mockup1": "./images/hospice-mockup1.png",
        "mockup2": "./images/hospice-mockup2.png",
        "mockup3": "./images/hospice-mockup3.png",
        "mockup4": "./images/hospice-mockup4.png",
        "screenshot1": "./images/hospice.screenshot-1.png",
        "screenshot2": "./images/hospice-screenshot-2.png",
        "logo": "./images/storytime-logo.png",
        "date": "2024-12-01"
    },
    {
        "name": "SeaStay Suites",
        "description": ": A retreat",
        "caption": "A platform for booking beachside accommodations in New Zealand, promoting sustainable tourism and local businesses.",
        "url": "https://sea-stay.vercel.app/",
        "previewMockup": "./images/seastay-prev-mockup.png",
        "previewImage": "./images/seastay-mockup-prev.png",
        "biographyBrief": "The SeaStay project was a fictional assignment, simulating a collaborative initiative with Tourism New Zealand to develop a platform dedicated to finding and booking beachside accommodations across New Zealand. Aiming to support sustainable tourism, SeaStay was designed to highlight New Zealand’s coastal beauty and diverse regions while fostering local business growth. The website offers refined search filters, detailed location information, and user ratings, providing a streamlined and user-friendly booking experience that enhances both traveler convenience and local tourism visibility. By aligning with Tourism New Zealand's brand identity, SeaStay aims to increase awareness and traffic for New Zealand's unique beachfront accommodations and local tourism initiatives.",
        "biographyTools": "The SeaStay project utilized a variety of tools and technologies essential for efficient development and design. Figma was employed for creating wireframes, designing UI components, and conducting prototyping and user testing. Visual Studio Code served as the primary coding environment, while GitHub was used for project storage and collaboration. Vercel was the deployment platform, making the website publicly accessible. JavaScript libraries such as jQuery, Mapbox, Swiper JS, and Fullpage JS were integrated to add interactivity and enhance the user experience. Additional tools included Gulp JS for task automation, Font Awesome for icons, and Unsplash for project images, creating a polished and functional final product.",
        "biographyOutcome": "The final SeaStay website met all specified deliverables, providing users with an easy-to-navigate interface to book beachfront accommodations. It offers a range of search filters to simplify finding seaside properties, detailed location information, and guest reviews, enhancing the user experience and supporting the local tourism industry. Despite a few HTML code warnings regarding empty headings populated by JavaScript, the project adhered to industry standards and achieved a consistent, modern design that reflects Tourism New Zealand's brand and appeals to travelers. SeaStay presents an accessible and visually appealing solution to address the demand for beachfront accommodations, promoting local tourism and facilitating a seamless booking experience.",
        "biographyReflection": "Working on SeaStay provided valuable insights into web development and project management. I enjoyed refining my skills in debugging JavaScript, integrating libraries, and using plugins to extend functionality, which challenged me to troubleshoot and enhance the website. The experience also underscored the importance of thorough planning and milestone management, helping me appreciate the value of setting realistic deadlines and deliverables. While I’m pleased with the project’s outcome, I would have liked more time to further develop certain aspects, ensuring all goals were met comprehensively. This project solidified my commitment to quality assurance, highlighted areas for growth, and inspired me to tackle future projects with refined planning and adaptability.",
        "tags": ["Gulp JS", "JQuery", "Mapbox", "Swiper JS", "Fullpage JS", "Figma", "Vercel"],
        "mockup1": "./images/seastay-mockup1.webp",
        "mockup2": "./images/seastay-mockup2.webp",
        "mockup3": "./images/seastay-mockup3.webp",
        "mockup4": "./images/seastay-mockup4.webp",
        "screenshot1": "./images/seastay-prev.jpg",
        "screenshot2": "./images/seastay-screenshot-2.png",
        "logo": "./images/seastay-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Friends of Golden Bay",
        "description": ": Friends of Golden Bay",
        "caption": "Friends of Golden Bay; a local conservational community, working to protect beautiful Golden Bay.",
        "url": "https://friends-of-golden-bay.vercel.app/",
        "previewMockup": "./images/fogb-mockup.webp",
        "previewImage": "./images/fogb-mockup-prev.png",
        "biographyBrief": "For an educational assignment, I undertook a project to redesign the Friends of Golden Bay (FOGB) website. The goal was to enhance their communication, improve functionality and usability, and effectively convey their mission to current and potential users. The project required a modern, mobile-first design that aligned with their brand identity and values, while also improving user engagement.",
        "biographyTools": "I utilized web technologies, including HTML, CSS, and JavaScript, alongside user experience design processes such as research, wireframing, and prototyping. Feedback from FOGB owners and iterative design methods were key in ensuring the design met the organization’s needs. Responsive design principles were applied to ensure functionality across mobile, tablet, and laptop devices.",
        "biographyOutcome": "The final design successfully addressed the issues of incoherent content and poor usability. The site now features a minimal, modern design that reflects the FOGB brand and provides clear access to information about their mission, campaigns, and ways to join or donate. Call-to-action elements and consistent design choices enhanced user engagement and accessibility.",
        "biographyReflection": "This project was a valuable learning experience in applying user-centered design principles. Feedback from the FOGB owners helped refine the solution and ensure it aligned with their goals. I gained practical skills in responsive design and user research while creating a website that improved usability and engagement for a meaningful cause.",
        "tags": ["Gulp JS", "JQuery", "Figma", "Vercel", "Prototyping", "User Testing"],
        "mockup1": "./images/fogb-mockup3.webp",
        "mockup2": "./images/fogb-mockup1.webp",
        "mockup3": "./images/fogb-mockup4.webp",
        "mockup4": "./images/fogb-mockup2.webp",
        "screenshot1": "./images/goldenbay-prev.webp",
        "screenshot2": "./images/fogb-mockup.webp",
        "logo": "./images/seastay-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Amy's Beauty Salon",
        "description": ": Reimagined",
        "caption": "A simple yet stylish website that set the foundation for my web design journey, blending functionality with minimalism.",
        "url": "",
        "previewImage": "./images/amy's-mockup-prev.png",
        "biographyBrief": "This project marked my first coding assignment, where I designed and developed a simple yet functional website using HTML, CSS, and a bit of JavaScript. This project was a great opportunity to put my design skills to use in a web development setting, and I focused on creating a minimalistic and visually cohesive design that served its purpose effectively.",
        "biographyTools": "The primary technologies I used for this project were HTML and CSS, which helped me build the structure and style of the website. I also incorporated basic JavaScript for added functionality, enhancing the interactivity of the site in subtle but effective ways. Figma was a key design tool throughout the project, allowing me to prototype the website and finalize its layout before coding. This combination of tools enabled me to create a cohesive and visually appealing final product that adhered to the intended design principles.",
        "biographyOutcome": "The website successfully achieved its goal of delivering a simple, clean user interface that aligns with modern design standards. Users found the website easy to navigate, and the feedback on the visual appeal and functionality was overwhelmingly positive. This project demonstrated my ability to create a working website from concept to completion, proving my understanding of the design process and validating my initial approach to combining form and function.",
        "biographyReflection": "Completing my first coding project was both challenging and incredibly rewarding, sparking a deep interest in web development. The positive feedback I received, especially considering it was my first attempt at building a site, encouraged me to continue exploring web design and coding. This project laid the groundwork for future learning, and the process of seeing a design come to life with code inspired me to push further and refine my skills in subsequent projects.",
        "tags": ["HTMl", "CSS", "Javascript", "Figma"],
        "mockup1": "./images/amyssalon-mockup1.webp",
        "mockup2": "./images/amyssalon-mockup2.webp",
        "mockup3": "./images/amyssalon-mockup3.webp",
        "mockup4": "./images/amyssalon-mockup4.webp",
        "screenshot1": "./images/amy-screenshot-1.jpg",
        "screenshot2": "./images/amy-screenshot-2.png",
        "logo": "./images/amy-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Hugo Prints",
        "description": ": Off the grid",
        "caption": "A sleek, interactive prototype for an online print store, blending modern design with an intuitive user experience.",
        "url": "https://hugo-designs.vercel.app/",
        "previewImage": "./images/hugo-mockup-prev.png",
        "biographyBrief": "This personal side project involved designing and developing a prototype for an online print store for a family member. The goal was to create a single-page website that was visually appealing, easy to navigate, and functional. The design aimed to reflect the business’s brand while providing an engaging user experience for potential customers looking to purchase print products. It was intended to be a proof of concept, showcasing how the online store could look and operate in a real-world scenario.",
        "biographyTools": "For this project, I used a combination of front-end technologies to bring the design to life. I structured the website with HTML, styled it with SCSS, and added interactivity using JavaScript and jQuery. To enhance the visual and functional elements, I incorporated libraries like Swiper JS for image sliders and Mapbox for an interactive map. The design was crafted using Figma to ensure a modern and responsive layout that would work seamlessly across devices.",
        "biographyOutcome": "The outcome was a functional and visually appealing prototype that met the project's objectives. The website design was responsive, allowing users to have an optimal viewing experience across different devices. The interactive features, like the image slider and map, added a layer of dynamism that improved user engagement. The project served as a valuable prototype that could be refined further for a live production version of the online print store.",
        "biographyReflection": "This project allowed me to experiment with several front-end technologies and refine my skills in web design. Working with jQuery, SCSS, and JavaScript libraries to enhance the user experience was an excellent learning opportunity. I enjoyed the challenge of balancing aesthetics with functionality while ensuring the site remained user-friendly. It also provided a chance to practice responsive design, which I found essential for creating a seamless experience across various screen sizes. This project ignited my passion for web development and provided me with a tangible result to showcase in my portfolio.",
        "tags": ["JQuery", "Swiper JS", "Mapbox", "SCSS/SASS", "Figma", "Filtering"],
        "mockup1": "./images/hugoprints-mockup1.webp",
        "mockup2": "./images/hugoprints-mockup2.webp",
        "mockup3": "./images/hugoprints-mockup3.webp",
        "mockup4": "./images/hugoprints-mockup4.webp",
        "screenshot1": "./images/hugo-screenshot-1.jpg",
        "screenshot2": "./images/hugo-screenshot-2.webp",
        "logo": "./images/hugo-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Lego Star Wars",
        "description": ": Geek out",
        "caption": "A playful, interactive catalog where LEGO Star Wars fans can explore and filter their favorite minifigures effortlessly.",
        "url": "https://lego-star-wars-minifigs.vercel.app/",
        "previewImage": "./images/lego-mockup-prev.png",
        "biographyBrief": "For this LEGO Star Wars minifigure catalog website, my goal was to build an interactive single-page experience that allowed users to seamlessly explore and discover various minifigure collections. The design approach focused on delivering a smooth, immersive experience, highlighting each minifigure while making the navigation intuitive and engaging. The catalog's layout is designed to be visually appealing and simple to use, with filtering options to help users locate specific minifigures easily.",
        "biographyTools": "I used several JavaScript plugins and libraries to bring this project to life. Fullpage.js was a key component in creating the smooth, scrollable single-page navigation, which gives the site a dynamic, modern feel. Gulp.js was used as a build toolkit, allowing me to automate tasks like minifying CSS and JavaScript, compiling Sass, and auto-refreshing the browser during development—making the process efficient and the code clean. Additionally, Node modules helped manage dependencies, ensuring that the project was organized and easy to maintain. For initial designs and layouts, I used Figma to prototype the UI components, refining the visual flow and catalog structure before development.",
        "biographyOutcome": "The final site successfully combines smooth navigation with visually appealing catalog sections, offering users a unique and engaging experience. Fullpage.js enabled a distinct single-page structure that lets users seamlessly scroll through the catalog, enhancing overall usability. Task automation with Gulp.js improved development efficiency, enabling a well-optimized, responsive site that feels lightweight and professional. Filtering options were also implemented to allow users to narrow down minifigures based on specific criteria, giving the site both functionality and depth.",
        "biographyReflection": "This project was an exciting challenge, as it allowed me to explore the power of JavaScript plugins and automation tools in a meaningful way. Working with Fullpage.js was particularly rewarding, as it opened up new design possibilities for creating interactive single-page layouts. Implementing Gulp.js to streamline the workflow was a significant learning experience, and it underscored the importance of efficient build processes and organized code management. Overall, this project strengthened my skills in JavaScript, automation, and responsive design, motivating me to continue exploring advanced plugins and workflows in future projects.",
        "tags": ["Fullpage JS", "JQuery", "Javascript", "Figma", "Filtering", "Gulp JS"],
        "mockup1": "./images/lego-starwars-minifig-mockup1.webp",
        "mockup2": "./images/lego-starwars-minifig-mockup2.webp",
        "mockup3": "./images/lego-starwars-minifig-mockup3.webp",
        "mockup4": "./images/lego-starwars-minifig-mockup4.webp",
        "screenshot1": "./images/lego-screenshot-1.jpg",
        "screenshot2": "./images/lego-screenshot-2.webp",
        "logo": "./images/lego-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Loosies Superette",
        "description": ": The revival",
        "caption": "A redesign of Loosie’s Superette, creating a vibrant digital space, reflecting the brand’s personality while making key info easy to find.",
        "url": "https://loosies-superette.vercel.app/",
        "previewImage": "./images/loosies-mockup-prev.png",
        "biographyBrief": "This project was a collaborative effort focused on enhancing the user experience of Loosie’s diner website. The original site lacked important information like service details, opening hours, and a design that visually represented the diner's brand. Our team worked together to identify these gaps and address them by creating a detailed UX brief. This document outlined each stage of the design process, helping to guide the development team later on. We prioritized delivering essential information—such as menu options and contact details—while ensuring the design aligned with Loosie's brand identity and catered to the target audience's needs.",
        "biographyTools": "Our team leveraged various tools to make the project both efficient and collaborative. Figma was essential in creating prototypes and visual layouts, enabling us to quickly iterate on designs. We used SCSS/SASS for styling, ensuring a clean and organized codebase that allowed for easy updates and responsive design adjustments. Regular scrums and collaborative meetings were key to maintaining alignment, allowing each team member to bring their strengths to the table. The use of a CSS pre-processor enhanced our workflow, making it easier to apply styles consistently throughout the site.",
        "biographyOutcome": "The redesigned website effectively conveyed Loosie’s brand and provided the necessary information for users, significantly improving accessibility and user satisfaction. Our thoughtful approach to UX, coupled with streamlined navigation and responsive design, resulted in a visually appealing and user-friendly website. The completed design featured valid HTML and CSS that adhered to industry standards, ensuring compatibility across devices. Additionally, our team’s consistent use of CSS methodologies led to a cohesive and well-structured layout, bringing Loosie's brand to life.",
        "biographyReflection": "This project taught me the importance of combining research with collaboration in order to build a design that meets both user and business objectives. I developed valuable skills in applying formative research techniques and analyzing insights to inform our design decisions. Working with my team was also a rewarding experience—I gained confidence in both prototyping and visual design, and our collaborative efforts enhanced the project outcome significantly. This experience reinforced the value of clear communication and teamwork, motivating me to apply these skills in future projects.",
        "tags": ["Scrums", "Research", "User Testing", "Figma", "SCSS/SASS", "Collaboration"],
        "mockup1": "./images/loosiessuperette-mockup1.webp",
        "mockup2": "./images/loosiessuperette-mockup2.webp",
        "mockup3": "./images/loosiessuperette-mockup3.webp",
        "mockup4": "./images/loosiessuperette-mockup4.webp",
        "screenshot1": "./images/loosies-screenshot-1.png",
        "screenshot2": "./images/loosies-screenshot-2.png",
        "logo": "./images/loosies-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "The Pokedex",
        "description": "",
        "caption": "A React-based Pokedex app that allows users to filter and view detailed information about all Pokémon.",
        "url": "https://pokedev-api.vercel.app/",
        "previewImage": "./images/pokedex-mockup-prev.png",
        "biographyBrief": "In this project, I created a Pokedex app using React and the PokeAPI, designed to allow users to browse, filter, and explore a full list of Pokemon. Users can search by type, name, or number and view detailed information about each Pokemon. This project served as a practical application of API integration, filter functionality, and responsive UI design, helping me deepen my understanding of building accessible and engaging interfaces in React.",
        "biographyTools": "The project utilized a range of tools and technologies to ensure an efficient and scalable build. React.js served as the primary framework, enabling a smooth, single-page application (SPA) experience. I used Vite as the project’s build tool for optimized development and production environments. The PokeAPI was essential for data sourcing, and I incorporated filtering functions to create a seamless, user-friendly experience. To keep the project organized, I followed Agile methodologies, used a project management tool to meet deadlines, and managed dependencies to streamline the development process.",
        "biographyOutcome": "The finished Pokedex app allows users to interact with a polished, intuitive interface where they can easily search and filter Pokemon data. The app’s responsive design and accessible navigation make it suitable for all audiences, and it performs well across devices, meeting industry standards for client-side applications. UML diagrams were created to document the app’s behavior and logic, supporting an organized, maintainable codebase. Overall, the app achieved its goals of functionality, performance, and accessibility, reflecting industry standards for SPAs.",
        "biographyReflection": "",
         "tags": ["API", "Vite", "React JS", "Filtering"],
        "mockup1": "./images/thepokedex-mockup1.webp",
        "mockup2": "./images/thepokedex-mockup2.webp",
        "mockup3": "./images/thepokedex-mockup3.webp",
        "mockup4": "./images/thepokedex-mockup4.webp",
        "screenshot1": "./images/pokedex-screenshot-1.png",
        "screenshot2": "./images/pokedex-screenshot-2.webp",
        "logo": "./images/pokedex-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Platypus Marketplace",
        "description": ": Pre-loved",
        "caption": "A user-friendly marketplace for buying and selling second-hand shoes, focusing on accessibility and brand identity.",
        "url": "https://github.com/PSTL-02/Second-Hand-Shoe-Reselling",
        "previewImage": "./images/platypus-mockup-prev.png",
        "biographyBrief": "Platypus Marketplace is a fictional website developed by myself and two other students, to provide a secondhand marketplace for buying and selling pre-loved shoes. Created with accessibility and ease of use in mind, the platform enables users to browse listings, create posts, and navigate easily with intuitive filters and clear hierarchies. Key features include a streamlined search function, categorized filters, and a user-friendly listing modal, making the posting process quick and intuitive. Each listing page presents essential details in a structured format that prioritizes visibility without obstructing images, offering a cohesive and visually appealing experience for shoe enthusiasts and casual users alike.",
        "biographyTools": "The development of Platypus Marketplace involved a comprehensive set of tools and technologies. Built on the MERN stack, the project utilized MongoDB for custom database needs, Express.js, and React for front-end design and functionality. SCSS/SASS was used to streamline and style CSS, enhancing the visual consistency of the site. Postman facilitated API testing, and Trello served as the project management tool, organizing tasks and tracking development progress. We used GitHub for version control and collaborative coding, which allowed team members to contribute code remotely while maintaining consistent standards. This approach ensured timely delivery, task alignment, and clear communication throughout the project.",
        "biographyOutcome": "The final design of Platypus Marketplace successfully met the objectives outlined in the brief, creating a platform that stays true to the Platypus brand identity and promotes self-expression through accessible, user-centered design. The site received positive feedback from users for its unique aesthetic, usability, and clear connection to Platypus's emphasis on authenticity, inclusivity, and individuality. The design allows for self-expression by encouraging users to buy and sell footwear that represents their personality, while the streamlined interface provides an inclusive experience that’s easy for all audiences to navigate. The completed project reflects the brand’s values, offering a meaningful and enjoyable experience for users seeking to give footwear a second life.",
        "biographyReflection": "This project was an invaluable experience in collaborative development and project management. Working with a team on a full-stack application helped me develop technical skills while enhancing my ability to communicate and collaborate effectively. Utilizing GitHub for version control and managing our tasks with Trello allowed us to experiment with different roles and responsibilities, balancing the workload and maintaining momentum. Through hands-on experience with debugging, UML diagram creation, and API integration, I gained a deeper understanding of project dependencies, quality assurance, and adhering to best practices in web development. Reflecting on this project, I am proud of the outcome and eager to apply these collaborative and technical skills to future projects.",
        "tags": ["API", "Postman", "Fullstack", "SCSS/SASS", "Express JS", "MongoDB", "Custom Database", "Mern"],
        "mockup1": "./images/platypusmarkerplace-mockup1.webp",
        "mockup2": "./images/platypusmarkerplace-mockup2.webp",
        "mockup3": "./images/platypusmarkerplace-mockup3.webp",
        "mockup4": "./images/platypusmarkerplace-mockup4.webp",
        "screenshot1": "./images/platypus-screenshot-1.png",
        "screenshot2": "./images/platypus-screenshot-2.png",
        "logo": "./images/platypus-logo.webp",
        "date": "2024-12-01"
    },
    {
        "name": "Workout App",
        "description": ": Get active",
        "caption": "A workout app designed to help users stay motivated and track progress with personalized routines.",
        "url": "https://frontend-boilerplate-cyan.vercel.app/",
        "previewImage": "./images/workout-mockup-prev.png",
        "biographyBrief": "This project was my first full-stack application, built using the MERN stack—MongoDB, Express.js, React, and Node.js—alongside SCSS for styling. I designed this platform as an interactive space where users can register, log in, and manage their own posts while engaging with content from other users. The core functionality of the site revolves around CRUD operations, enabling users to create, edit, and delete posts and comments. I implemented password hashing and salting for secure user authentication, while a custom database API keeps the app running efficiently and securely. SCSS/SASS brings a clean and modern design to the interface, making the site easy to navigate and visually engaging.",
        "biographyTools": "To bring this project to life, I used a variety of essential tools and technologies that made the development process both challenging and rewarding. MongoDB served as the database, storing user and post data, while Express.js and Node.js handled server-side logic. React was used on the front end to create a dynamic and responsive interface, while SCSS provided the styling needed for a modern and polished look. For testing and validating the API, I used Postman, which helped ensure each endpoint functioned as intended. Working with the MERN stack and SCSS demonstrated the power and flexibility of these technologies in building an interactive, full-stack application.",
        "biographyOutcome": "The final outcome is a user-friendly, interactive platform that allows for seamless user management and content interaction. The CRUD functionality and secure authentication work together smoothly, providing users with a cohesive experience in creating and engaging with content. The SCSS styling gave the project a clean and contemporary look, aligning well with the goals of accessibility and ease of use. It was exciting to see all the features—user registration, login, posting, and commenting—come together into a functional application that aligns well with the initial design vision.",
        "biographyReflection": "Working on this full-stack project was a fantastic opportunity to dive deep into the MERN stack and experience how each technology contributes to a fully functional application. Building a secure user management system with hashed and salted passwords was especially rewarding, as it challenged me to focus on application security alongside functionality. Seeing everything come together—from the API to the front-end design—reinforced the value of full-stack development in creating interactive and user-centered applications. Overall, this project pushed me to explore new technologies and tools, and it has motivated me to keep building and refining my skills in full-stack development.",
        "tags": ["API", "Postman", "Fullstack", "SCSS/SASS", "Express JS", "MongoDB", "Custom Database", "Mern"],
        "mockup1": "./images/workoutapp-mockup1.webp",
        "mockup2": "./images/workoutapp-mockup2.webp",
        "mockup3": "./images/workoutapp-mockup3.webp",
        "mockup4": "./images/workoutapp-mockup4.webp",
        "screenshot1": "./images/workout-screenshot-1.webp",
        "screenshot2": "./images/workout-screenshot-2.jpg",
        "logo": "./images/workout-logo.webp",
        "date": "2024-12-01"
    }
]