[
    {
        "id": 1,
        "name": "Friends of",
        "description": "Golden Bay",
        "url": "https://friends-of-golden-bay.vercel.app/",
        "previewImage": "./images/fogb-mockup2.jpg",
        "coverImage": "./images/goldenbay-prev.jpg",
        "mockup": "./images/fogb-mockup.png",
        "imageLarge": "./images/fogb-large.jpg",
        "imageMed": "./images/fogb-med.jpg",
        "imageSmall": "./images/fogb-small.jpg",
        "biographyMajor": "The Friends of Golden Bay (FOGB) project involved redesigning their existing website to better communicate their mission, enhance functionality, and improve usability across devices. The goal was to create a modern and representative site that aligns with FOGB's brand identity, encourages new participants to join their cause, and maintains engagement with current users. The redesign was informed by extensive research into the existing site's usability and user experience, identifying pain points and opportunities for improvement. The resulting website effectively communicates FOGB's mission and impact on the Golden Bay environment.",
        "biographyMinor": "Throughout the Friends of Golden Bay (FOGB) project, I gained valuable insights and experience in various aspects of web development and design. I learned to identify and consider the implications of the Treaty of Waitangi in project planning, ensuring cultural respect and alignment. I implemented visual design principles and applied formative UX research techniques to inform initial design concepts, ensuring a user-centered approach. Additionally, I tested design prototypes using collaborative tools, produced CSS with a CSS processor (SASS), and utilized advanced HTML, CSS, and introductory JavaScript to create interactive interfaces. The project involved developing usability standards, employing appropriate testing methodologies, and consistently applying a selected CSS methodology. Finally, I made sure to adhere to standard copyright conventions, reinforcing the importance of ethical practices in web development.",
        "tags": ["SCSS/SASS", "Javascript", "Responsiveness", "User Testing"]
    },
    {
        "id": 2,
        "name": "SeaStay",
        "description": "Accommodation",
        "url": "https://sea-stay.vercel.app/",
        "previewImage": "./images/seastay-mockup4.jpg",
        "coverImage": "./images/seastay-prev.jpg",
        "mockup": "./images/seastay-mockup.png",
        "imageLarge": "./images/seastay-large.jpg",
        "imageMed": "./images/seastay-med.jpg",
        "imageSmall": "./images/seastay-small.jpg",
        "biographyMajor": "SeaStay was a fictional assingment to replicate a collaborative project with Tourism New Zealand, aiming to create a dedicated platform for finding and booking beachside accommodations across New Zealand. The website is designed to promote sustainable and authentic tourism while highlighting the beauty and diversity of New Zealand's coastal regions. By offering refined search filters, detailed location information, and user ratings, SeaStay provides a streamlined, user-friendly experience that not only enhances the booking process for travelers but also supports local tourism businesses. The site reflects a clean, modern design that aligns with TourismNZ's brand identity, fostering increased traffic and awareness for local tourism initiatives.",
        "biographyMinor": "Through the SeaStay project, I gained valuable experience in several key areas of web development. I learned to effectively debug JavaScript code to eliminate errors, integrate and extend JavaScript libraries with third-party plugins, and use a variety of production tools to streamline development. I honed my skills in manipulating the DOM with raw JavaScript and libraries, implementing UI component functionality, and maintaining consistent code quality by adhering to a style guide and testing against industry standards. The project also reinforced the importance of thorough planning, including defining deliverables based on use cases, setting critical deadlines, and writing detailed proposals. Analyzing variations from the planned milestones during the project's execution provided important lessons in project management and adaptability.",
        "tags": ["Gulp JS", "JQuery", "Mapbox", "Swiper JS", "Fullpage JS", "Figma", "Vercel"]
    },
    {
        "id": 3,
        "name": "Platypus",
        "description": "Marketplace",
        "url": "https://github.com/PSTL-02/Second-Hand-Shoe-Reselling",
        "previewImage": "./images/platypusmarkerplace-mockup3.jpg",
        "coverImage": "./images/platypus-prev.jpg",
        "mockup": "./images/platypus-marketplace-mockup2.png",
        "imageLarge": "./images/platypus-large.png",
        "imageMed": "./images/platypus-med.png",
        "imageSmall": "./images/platypus-small.png",
        "biographyMajor": "Platypus Marketplace, is a fictitious website, created alongside a team of fellow students, to function as a user-friendly platform for buying and selling pre-loved shoes. Designed with an emphasis on accessibility and ease of use, this secondhand marketplace allows users to browse listings, create new posts, and navigate seamlessly with clear hierarchies and intuitive filters. Key features include a streamlined search function, categorized filters, and a create listing modal that simplifies the posting process. Each listing page is thoughtfully structured to keep essential details in view without obstructing images, offering a consistent and visually appealing experience for shoe enthusiasts looking to give footwear a second life.",
        "biographyMinor": "",
        "tags": ["API", "Postman", "Fullstack", "SCSS/SASS", "Express JS", "MongoDB", "Custom Database", "Mern"]
    },
    {
        "id": 4,
        "name": "Workout",
        "description": "App",
        "url": "https://frontend-boilerplate-cyan.vercel.app/",
        "previewImage": "./images/workoutapp-mockup1.jpg",
        "coverImage": "./images/workout-prev.jpg",
        "mockup": "./images/workout-mockup.png",
        "imageLarge": "./images/workout-large.jpg",
        "imageMed": "./images/workout-small.png",
        "biographyMajor": "This was my first full-stack project that was built with React, Express.js, MongoDB, SCSS as well as including password hashing and salting for security. The project was deisgned to create an interactive space where users can register, log in, manage their postings, and engage withother users posts. This project focused on the CRUD method, of creating, editing, and deleting posts, along with a commenting system. I used a custom database API to keep things running smoothly and securely. The design is clean and modern, thanks to SCSS/SASS, making the whole site easy to navigate and pleasant to look at. ",
        "biographyMinor": "Working on a fullStack project was a great way to dive into the MERN stack and see how all these technologies come together. The project shows how flexible full-stack development can be for building interactive and user-friendly applications. Plus, it’s satisfying to see all the features like user management and content interaction working seamlessly together. Overall, this was an exciting activity to push myself and discover new technologies and tools.",
        "tags": ["API", "Postman", "Fullstack", "SCSS/SASS", "Express JS", "MongoDB", "Custom Database", "Mern"]
    },
    {
        "id": 5,
        "name": "Lego Star Wars",
        "description": "Minifig Catalog",
        "url": "https://lego-star-wars-minifigs.vercel.app/",
        "previewImage": "./images/lego-starwars-minifig-mockup1.jpg",
        "coverImage": "./images/lego-prev.jpg",
        "mockup": "./images/lego-mockup.png",
        "imageLarge": "./images/lego-large.jpg",
        "imageMed": "./images/lego-med.jpg",
        "imageSmall": "./images/lego-small.jpg",
        "biographyMajor": "For the LEGO Star Wars minifigure catalog website, I utilized several JavaScript plugins and libraries to enhance functionality and streamline the development process. I implemented fullpage.js to create a seamless, interactive single-page experience, allowing users to navigate smoothly between sections of the catalog. To automate tasks and optimize the workflow, I used gulp.js, a toolkit that helps with tasks such as minifying CSS and JavaScript files, compiling Sass, and refreshing the browser on file changes. Additionally, Node modules were employed to manage dependencies and build tools, ensuring that the website was both efficient and easy to maintain. These technologies collectively allowed me to create a dynamic and engaging user experience while maintaining a clean and efficient codebase.",
        "biographyMinor": "",
        "tags": ["Fullpage JS", "JQuery", "Javascript", "Figma", "Filtering"]
    },
    {
        "id": 6,
        "name": "Loosies",
        "description": "Superette",
        "url": "https://loosies-superette.vercel.app/",
        "previewImage": "./images/loosiessuperette-mockup1.jpg",
        "coverImage": "./images/loosies-prev.jpg",
        "mockup": "./images/loosies-mockup.png",
        "imageLarge": "./images/loosies-large.jpg",
        "imageMed": "./images/loosies-med.jpg",
        "imageSmall": "./images/loosies-small.jpg",
        "biographyMajor": "This project was a collaborative effort where our group worked closely together to improve the user experience of Loosie’s primary website. The existing site lacked key information, such as service details and opening hours, and didn't visually reflect the diner's brand. Together, we addressed these issues by developing a comprehensive UX brief that documented each step of the design process, providing a solid foundation for the internal team during the development stage. Our team focused on delivering essential information to users, such as menu details and contact information, while ensuring the design accurately represented Loosie's brand and met the needs of its target audience. Throughout the project, we collaborated effectively, leveraging each other's strengths to achieve our common goal.",
        "biographyMinor": "In this project, I developed key skills in applying formative research techniques, analyzing research results to draw meaningful insights, and making informed design decisions based on those findings. I also enhanced my abilities in prototyping and visual design, ensuring that the final product met user expectations and business goals. Working closely with my team, I learned the value of collaboration, effectively contributing to our shared objectives and supporting each other throughout the design process.",
        "tags": ["Scrums", "Research", "User Testing", "Figma", "SCSS/SASS", "Collaboration"]
    },
    {
        "id": 7,
        "name": "The",
        "description": "Pokedex",
        "url": "https://pokedev-api.vercel.app/",
        "previewImage": "./images/thepokedex-mockup1.jpg",
        "coverImage": "./images/pokedex-prev.jpg",
        "mockup": "./images/pokemon-mockup.png",
        "imageLarge": "./images/pokedex-large.png",
        "imageMed": "./images/pokedex-med.png",
        "imageSmall": "./images/pokedex-small.jpg",
        "biographyMajor": "This project involved creating a Pokedex app using React and the PokeAPI. The app allows users to browse a list of all Pokemon, filter them by type, name, or number, and view detailed information about each individual Pokemon. The project was designed to deepen my understanding of working with APIs, implementing filters, and building responsive, accessible user interfaces in React.",
        "biographyMinor": "",
        "tags": ["API", "Vite", "React JS", "Filtering"]
    },
    {
        "id": 8,
        "name": "Amy's",
        "description": "Beauty Salon",
        "url": "",
        "previewImage": "./images/amyssalon-mockup1.jpg",
        "coverImage": "./images/amy-prev.jpg",
        "mockup": "./images/amy-mockup.png",
        "imageLarge": "./images/amy-large.jpg",
        "imageMed": "./images/amy-med.jpg",
        "imageSmall": "./images/amy-small.jpg",
        "biographyMajor": "This project was my first coding assignment, where I had the opportunity to apply my design skills and knowledge. I created a minimalistic and functional website design using primarily HTML, CSS and minimal Javascript. This experience ignited my passion for web design and coding, as I thoroughly enjoyed the process. The encouraging feedback I received on the design and functionality, especially considering it was my first time creating a website, motivated me to push myself even further in future projects.",
        "biographyMinor": "",
        "tags": ["HTMl", "CSS", "Javascript", "Figma"]
    },
    {
        "id": 9,
        "name": "Hugo",
        "description": "Prints ",
        "url": "https://hugo-designs.vercel.app/",
        "previewImage": "./images/hugoprints-mockup1.jpg",
        "coverImage": "./images/hugo-prev.jpg",
        "mockup": "./images/hugo-mockup.png",
        "imageLarge": "./images/hugo-large.jpg",
        "imageMed": "./images/hugo-med.png",
        "imageSmall": "./images/hugo-small.jpg",
        "biographyMajor": "As a personal side project, I designed and developed an example page for a family member's online print store. The goal was to create a visually appealing and functional single-page website that could serve as a prototype for their business. I utilized HTML for the structure, SCSS for styling, and JavaScript, along with jQuery and other JavaScript libraries, to add interactivity and enhance the user experience. This project allowed me to experiment with front-end technologies and refine my skills in creating responsive, modern web designs.",
        "biographyMinor": "",
        "tags": ["JQuery", "Swiper JS", "Mapbox", "SCSS/SASS", "Figma", "Filtering"]
    }
]