[
    {
        "id": 1,
        "name": "Toronto,",
        "description": "Cupcake",
        "coverImage": "./images/cupcake-prev.jpg",
        "url": "",
        "mockup": "",
        "imageLarge": "",
        "imageMed": "",
        "imageSmall": "",
        "biographyMajor": "",
        "biographyMinor": "",
        "tags": []
    },
    {
        "id": 5,
        "name": "Big Bird",
        "description": "App",
        "url": "https://www.figma.com/proto/5sNgr7r2zBebuNoLBSTdSN/Big-Bird-Proto?page-id=0%3A1&type=design&nodeid=46-324&viewport=-5792%2C-9214%2C1.18&scaling=scale-down&starting-point-node-id=46%3A324&mode=design",
        "coverImage": "./images/bigbird-prev.jpg",
        "mockup": "./images/bigbird-mockup.png",
        "imageLarge": "./images/bigbird-large.png",
        "imageMed": "./images/bigbird-med.png",
        "imageSmall": "./images/bigbird-small.png",
        "biographyMajor": "This project was an educational assignment where our team collaborated on a fictional brief for Wellington City Council and Zealandia Ecosanctuary, where we worked together to design a smartphone app aimed at increasing youth engagement with local recreational facilities. This project focused on creating an effective and engaging app that would encourage young people to explore Wellington's free or low-cost recreational offerings, especially during the holidays. By drawing inspiration from nostalgic arcade games, our design featured a unique pixelated style that appealed to the target audience of young teens. Throughout the project, we used Figma and other collaboration tools to communicate, plan, and iterate on the design, ensuring that the final product aligned with the client’s goals and resonated with users. Each team member contributed significantly, and the successful outcome of the project highlighted our ability to work together effectively and creatively.",
        "biographyMinor": "During this educational assignment, I gained valuable experience in problem-solving by identifying appropriate research methods, defining key stakeholders, and understanding the advantages and disadvantages of user interfaces. The project emphasized an iterative design process, where usability testing and feedback were integral to developing a user interface. I learned to create prototypes, set and meet project milestones, and respond to feedback effectively. Presenting my work and addressing moral and ethical concerns were also key aspects. This project honed my leadership and collaborative skills, which are crucial in user interface development.",
        "tags": ["Collaboration", "Scrums", "Figma", "User Testing", "Research"]
    }
]